Question 1

Question: How do you select rows from a DataFrame where any value in the row exceeds a threshold?

In [37]:
import numpy as np
import pandas as pd

In [38]:
data = pd.DataFrame(np.random.standard_normal((1000, 4)))

data

            0         1         2         3
0    1.676041  0.516248 -0.780587  0.040242
1   -0.890487 -0.027162  0.854784  2.304333
2   -0.208289  0.032268 -0.227045  1.416115
3   -0.157021  0.093317  0.208483 -0.449504
4   -1.501703 -0.798603  0.436729 -0.052205
..        ...       ...       ...       ...
995 -1.088702 -2.174657 -1.132469 -0.303230
996  0.105797  1.398370  1.274014  0.164250
997  0.305116  0.394808  1.203751  0.050824
998  0.640903 -0.176277  1.509002  0.597439
999 -1.041793  1.354755 -0.691646  0.485487

[1000 rows x 4 columns]

In [39]:
data[(data > 3).any(axis="columns")]

            0         1         2         3
236  0.203668  3.040672  1.256168 -0.372566
447 -0.513359  0.163097  3.158323  1.719650
734 -0.729499  3.205621 -1.453437  0.347438
741  1.016933 -1.549153  3.251794  0.404715

Question 2

Question: How do you sort a DataFrame by columns A and B?

In [40]:
import pandas as pd

df = pd.DataFrame({'A': [2, 1, 2], 'B': [2, 3, 1], 'C': [1, 2, 3]})
df

   A  B  C
0  2  2  1
1  1  3  2
2  2  1  3

In [41]:
df.sort_values(by=["A","B"], ascending=True)

   A  B  C
1  1  3  2
2  2  1  3
0  2  2  1

Question 3

Question: How do you concatenate two DataFrames vertically?

In [42]:
import pandas as pd

df1 = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6]})
df2 = pd.DataFrame({'A': [7, 8, 9], 'B': [10, 11, 12]})
print(df1)
print(df2)

   A  B
0  1  4
1  2  5
2  3  6
   A   B
0  7  10
1  8  11
2  9  12

In [44]:
df = pd.concat([df1,df2])
print(df)
df.reset_index(drop=True)

   A   B
0  1   4
1  2   5
2  3   6
0  7  10
1  8  11
2  9  12

   A   B
0  1   4
1  2   5
2  3   6
3  7  10
4  8  11
5  9  12

Question 4

Question: How do you compute the cumulative sum of a column in a DataFrame?

In [45]:
import pandas as pd

df = pd.DataFrame({'A': [1, 2, 3, 4, 5]})

df

   A
0  1
1  2
2  3
3  4
4  5

In [46]:

df["B"]=df["A"].cumsum()
df

   A   B
0  1   1
1  2   3
2  3   6
3  4  10
4  5  15

Question 5

Question: How do you convert a Series of strings to uppercase?

In [47]:
import pandas as pd

series = pd.Series(['apple', 'banana', 'cherry'])

series

0     apple
1    banana
2    cherry
dtype: object

In [48]:
series.str.upper()

0     APPLE
1    BANANA
2    CHERRY
dtype: object